src/cf/InformationRegisters/ПравилаОбработкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПравилаОбработкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиДействий</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаВключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидОбъектаСОбработкой</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПравилоОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/НастройкиДействийВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// см. НастройкиДействий.ИмяСправочникаПоВидуДействия
// 
Функция ИмяСправочникаПоВидуДействия(Знач ВидДействия) Экспорт
	
	Возврат НастройкиДействий.ИмяСправочникаПоВидуДействия(ВидДействия);
	
КонецФункции

// см. НастройкиДействий.КоличествоНастроекПравилОбработки
//
Функция КоличествоНастроекПравилОбработки(РазрезНастройки) Экспорт 
	
	Возврат НастройкиДействий.КоличествоНастроекПравилОбработки(РазрезНастройки);
	
КонецФункции

// Включает или выключает настройку правила обработки
// 
// Параметры:
// 	ПравилоОбработки - СправочникСсылка.ПравилаОбработки - ссылка на правило обраобтки
// 	ВидДействия - СправочникСсылка.ВидыДействий - ссылка на вид действия
// 	НастройкаВключена - Булево - признак включения или выключения настройки.
//
Процедура ПереключитьНастройкуДействия(ПравилоОбработки, ВидДействия, НастройкаВключена) Экспорт 
	
	РегистрыСведений.ПравилаОбработкиОбъектов.ПереключитьНастройкуДействия(
		ПравилоОбработки, ВидДействия, НастройкаВключена);
	
КонецПроцедуры

// см. НастройкиДействий.ЗаполнитьДействияДляПравилаОбработки
//
Процедура ЗаполнитьДействияДляПравилаОбработки(Действия, КлючНастроек) Экспорт 
	
	НастройкиДействий.ЗаполнитьДействияДляПравилаОбработки(Действия, КлючНастроек);
	
КонецПроцедуры

// см. НастройкиДействий.УдалитьНастройкуДействияПравилаОбработки
//
Процедура УдалитьНастройкуДействияПравилаОбработки(ПравилоОбработки, ВидДействия, Настройка) Экспорт 
	
	НастройкиДействий.УдалитьНастройкуДействияПравилаОбработки(ПравилоОбработки, ВидДействия, Настройка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
